tutorials/cfdemSolverRhoPimpleChem/PolydisperseFluidizedBed/R3_FB/CFD/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo; //hePsiThermo;
    mixture         reactingMixture; //species and reactions are listed in chemistry file
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    energy          sensibleInternalEnergy; //sensibleEnthalpy;
    specie          specie;
}

chemistryReader foamChemistryReader;

foamChemistryThermoFile "$FOAM_CASE/constant/foam.dat";

foamChemistryFile       "$FOAM_CASE/constant/foam.inp";

inertSpecie N2;

// ************************************************************************* //
