tutorials/cfdemSolverRhoPimpleChem/PolydisperseFluidizedBed/R3_FB/CFD/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "(rho|G)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(rho|G)Final"
    {
        $rho;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|h|e|R|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
        maxIter         100;
    }

    "(U|h|e|R|k|epsilon)Final"
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }

    "(Yi|CO|CO2|H2|H2O|N2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.01;
        maxIter         100;
    }

    "(Yi|CO|CO2|H2|H2O|N2)Final"
    {
        $Yi;
        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }

    T
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 5;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    rhoMin  rhoMin [ 1 -3 0 0 0 ] 0.4;
    rhoMax  rhoMax [ 1 -3 0 0 0 ] 2.0;
}

relaxationFactors
{
    fields
    {
        T   0.5;
        "(Yi|CO|CO2|H2|H2O|N2)" 0.6;
        p   0.6;
    }
    equations
    {
        ".*"            0.8;
        "(h|e).*"       0.5;
    }
}

// ************************************************************************* //
